turbq/atprog/packs/atmel/SAM3N_DFP/1.0.62/atdf/ATSAM3N4A.atdf
    <module caption="Digital-to-Analog Converter Controller" name="DACC" version="11025A">
      <register-group name="DACC">
        <register caption="Control Register" name="DACC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="DACC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Enable" mask="0x00000001" name="TRGEN"/>
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL" values="DACC_MR__TRGSEL"/>
          <bitfield caption="DAC enable" mask="0x00000010" name="DACEN"/>
          <bitfield caption="Word Transfer" mask="0x00000020" name="WORD"/>
          <bitfield caption="Startup Time Selection" mask="0x0000FF00" name="STARTUP"/>
          <bitfield caption="DAC Clock Divider for Internal Trigger" mask="0xFFFF0000" name="CLKDIV"/>
        </register>
        <register caption="Conversion Data Register" name="DACC_CDR" offset="0x08" rw="W" size="4">
          <bitfield caption="Data to Convert" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="Interrupt Enable Register" name="DACC_IER" offset="0x0C" rw="W" size="4">
          <bitfield caption="Transmission Ready Interrupt Enable" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="End of PDC Interrupt Enable" mask="0x00000002" name="ENDTX"/>
          <bitfield caption="Buffer Empty Interrupt Enable" mask="0x00000004" name="TXBUFE"/>
        </register>
        <register caption="Interrupt Disable Register" name="DACC_IDR" offset="0x10" rw="W" size="4">
          <bitfield caption="Transmission Ready Interrupt Disable" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="End of PDC Interrupt Disable" mask="0x00000002" name="ENDTX"/>
          <bitfield caption="Buffer Empty Interrupt Disable" mask="0x00000004" name="TXBUFE"/>
        </register>
        <register caption="Interrupt Mask Register" name="DACC_IMR" offset="0x14" rw="R" size="4">
          <bitfield caption="Transmission Ready Interrupt Mask" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="End of PDC Interrupt Mask" mask="0x00000002" name="ENDTX"/>
          <bitfield caption="Buffer Empty Interrupt Mask" mask="0x00000004" name="TXBUFE"/>
        </register>
        <register caption="Interrupt Status Register" name="DACC_ISR" offset="0x18" rw="R" size="4">
          <bitfield caption="Transmission Ready Interrupt Flag" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="End of PDC Interrupt Flag" mask="0x00000002" name="ENDTX"/>
          <bitfield caption="Buffer Empty Interrupt Flag" mask="0x00000004" name="TXBUFE"/>
        </register>
        <register caption="Write Protect Mode Register" name="DACC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="DACC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write protection error" mask="0x00000001" name="WPROTERR"/>
          <bitfield caption="Write protection error address" mask="0x0000FF00" name="WPROTADDR"/>
        </register>
        <register caption="Transmit Pointer Register" name="DACC_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="DACC_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="DACC_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="DACC_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="DACC_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="DACC_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="DACC_MR__TRGSEL">
        <value caption="External trigger" name="TRGSEL0" value="0x0"/>
        <value caption="TIO Output of the Timer Counter Channel 0" name="TRGSEL1" value="0x1"/>
        <value caption="TIO Output of the Timer Counter Channel 1" name="TRGSEL2" value="0x2"/>
        <value caption="TIO Output of the Timer Counter Channel 2" name="TRGSEL3" value="0x3"/>
      </value-group>
    </module>
    <module caption="Embedded Flash Controller" name="EFC" version="6450H">
      <register-group name="EFC">
        <register caption="EEFC Flash Mode Register" name="EEFC_FMR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Ready Interrupt Enable" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Wait State" mask="0x00000F00" name="FWS"/>
          <bitfield caption="Sequential Code Optimization Disable" mask="0x00010000" name="SCOD"/>
          <bitfield caption="Flash Access Mode" mask="0x01000000" name="FAM"/>
        </register>
        <register caption="EEFC Flash Command Register" name="EEFC_FCR" offset="0x04" rw="W" size="4">
          <bitfield caption="Flash Command" mask="0x000000FF" name="FCMD" values="EEFC_FCR__FCMD"/>
          <bitfield caption="Flash Command Argument" mask="0x00FFFF00" name="FARG"/>
          <bitfield caption="Flash Writing Protection Key" mask="0xFF000000" name="FKEY" values="EEFC_FCR__FKEY"/>
        </register>
        <register caption="EEFC Flash Status Register" name="EEFC_FSR" offset="0x08" rw="R" size="4">
          <bitfield caption="Flash Ready Status" mask="0x00000001" name="FRDY"/>
          <bitfield caption="Flash Command Error Status" mask="0x00000002" name="FCMDE"/>
          <bitfield caption="Flash Lock Error Status" mask="0x00000004" name="FLOCKE"/>
        </register>
        <register caption="EEFC Flash Result Register" name="EEFC_FRR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Flash Result Value" mask="0xFFFFFFFF" name="FVALUE"/>
        </register>
      </register-group>
      <value-group caption="" name="EEFC_FCR__FCMD">
        <value caption="Get Flash Descriptor" name="GETD" value="0x00"/>
        <value caption="Write page" name="WP" value="0x01"/>
        <value caption="Write page and lock" name="WPL" value="0x02"/>
        <value caption="Erase page and write page" name="EWP" value="0x03"/>
        <value caption="Erase page and write page then lock" name="EWPL" value="0x04"/>
        <value caption="Erase all" name="EA" value="0x05"/>
        <value caption="Set Lock Bit" name="SLB" value="0x08"/>
        <value caption="Clear Lock Bit" name="CLB" value="0x09"/>
        <value caption="Get Lock Bit" name="GLB" value="0x0A"/>
        <value caption="Set GPNVM Bit" name="SGPB" value="0x0B"/>
        <value caption="Clear GPNVM Bit" name="CGPB" value="0x0C"/>
        <value caption="Get GPNVM Bit" name="GGPB" value="0x0D"/>
        <value caption="Start Read Unique Identifier" name="STUI" value="0x0E"/>
        <value caption="Stop Read Unique Identifier" name="SPUI" value="0x0F"/>
        <value caption="Get CALIB Bit" name="GCALB" value="0x10"/>
      </value-group>
